## staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 11 to add, 3 to change, 5 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                NAME                                |
|----------|--------------------------------------------------------------------|
| update   | `module.gha_vpn.aws_ec2_client_vpn_endpoint.this`                  |
|          | `module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder` |
|          | `module.vpn.aws_ec2_client_vpn_endpoint.this`                      |
| recreate | `aws_acm_certificate.client_vpn`                                   |
| add      | `aws_iam_role.admin`                                               |
|          | `aws_iam_role.document_download`                                   |
|          | `aws_iam_role_policy_attachment.admin_worker`                      |
|          | `aws_iam_role_policy_attachment.document_download_worker`          |
|          | `aws_iam_role_policy_attachment.parameters_csi_admin`              |
|          | `aws_iam_role_policy_attachment.parameters_csi_document_download`  |
|          | `aws_iam_role_policy_attachment.secrets_csi_admin`                 |
|          | `aws_iam_role_policy_attachment.secrets_csi_document_download`     |
|          | `tls_private_key.client_vpn`                                       |
|          | `tls_self_signed_cert.client_vpn`                                  |
| delete   | `aws_acmpca_certificate.client_vpn`                                |
|          | `aws_acmpca_certificate_authority.client_vpn`                      |
|          | `aws_acmpca_certificate_authority_certificate.client_vpn`          |
|          | `time_sleep.wait_for_cert_authority`                               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.client_vpn must be replaced
+/- resource "aws_acm_certificate" "client_vpn" {
      ~ arn                       = "arn:aws:acm:ca-central-1:239043911459:certificate/1da1e99f-489f-40a0-8fd9-6db469269906" -> (known after apply)
      - certificate_authority_arn = "arn:aws:acm-pca:ca-central-1:239043911459:certificate-authority/96eb8ee4-b746-4b80-803a-ae5ecdbca932" -> null # forces replacement
      + certificate_body          = (known after apply)
      ~ domain_name               = "staging.notification.canada.ca" -> (known after apply)
      ~ domain_validation_options = [] -> (known after apply)
      ~ id                        = "arn:aws:acm:ca-central-1:239043911459:certificate/1da1e99f-489f-40a0-8fd9-6db469269906" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2025-10-10T14:59:23Z" -> (known after apply)
      ~ not_before                = "2024-09-10T13:59:23Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      + private_key               = (sensitive value)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [
          - "staging.notification.canada.ca",
        ] -> (known after apply)
      ~ tags                      = {
          + "CostCenter"  = "notification-canada-ca-staging"
          - "Environment" = "staging" -> null
          + "Name"        = "notification-canada-ca"
        }
      ~ tags_all                  = {
          + "CostCenter"  = "notification-canada-ca-staging"
          - "Environment" = "staging" -> null
          + "Name"        = "notification-canada-ca"
        }
      ~ type                      = "PRIVATE" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
      ~ validation_method         = "NONE" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ options {
          + arn                       = (known after apply)
          + certificate_authority_arn = (known after apply)
          + certificate_body          = (known after apply)
          + certificate_chain         = (known after apply)
          + domain_name               = (known after apply)
          + domain_validation_options = (known after apply)
          + early_renewal_duration    = (known after apply)
          + id                        = (known after apply)
          + key_algorithm             = (known after apply)
          + not_after                 = (known after apply)
          + not_before                = (known after apply)
          + pending_renewal           = (known after apply)
          + private_key               = (known after apply)
          + renewal_eligibility       = (known after apply)
          + renewal_summary           = (known after apply)
          + status                    = (known after apply)
          + subject_alternative_names = (known after apply)
          + tags                      = (known after apply)
          + tags_all                  = (known after apply)
          + type                      = (known after apply)
          + validation_emails         = (known after apply)
          + validation_method         = (known after apply)
        } -> (known after apply)
    }

  # aws_acmpca_certificate.client_vpn will be destroyed
  # (because aws_acmpca_certificate.client_vpn is not in configuration)
  - resource "aws_acmpca_certificate" "client_vpn" {
      - arn                         = "arn:aws:acm-pca:ca-central-1:239043911459:certificate-authority/96eb8ee4-b746-4b80-803a-ae5ecdbca932/certificate/7f814242df26f725857f48c48d5dd2dd" -> null
      - certificate                 = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIFDjCCAvagAwIBAgIQf4FCQt8m9yWFf0jEjV3S3TANBgkqhkiG9w0BAQ0FADAh
            MR8wHQYDVQQDDBZub3RpZmljYXRpb24uY2FuYWRhLmNhMB4XDTI0MDkxMDEzNTky
            MFoXDTI5MDkxMDE0NTkyMFowITEfMB0GA1UEAwwWbm90aWZpY2F0aW9uLmNhbmFk
            YS5jYTCCAiIwDQYJKoZIhvcNAQEBBQADggIPADCCAgoCggIBAOZc31f25t9qp59K
            KEBt3D30vBP7F9zqd0Bo3M1Scp5iXERxosLLiNvAHZsA7KxpYokROoV6ljhT4wjN
            dHaoKtYf5CipcYJDNGRqEeGZgBk4yYAC2i1o4IuPK/7kp1GMcv9K+4aJ4m4ilSSh
            o1bdaPg9PZdsI4Hd5AcjZXSHjsQaS+ptdRSpFJZZks79vZEQ+2WB9WSxAne84OCZ
            8Ec7ADLDwZbpEsr3gmjKeub9VnGkur6s4gI/U1X3wFiJiLoTOA6268O3YrNTh3QN
            E55PJt1zUVPkXL66YmRLKg3coXVmwCrMTsqe+YezLLO/ukMHIcCIcSB/pIr57s6H
            to27s1sPWdbj6yMk2mzDEvekaMRfim/4MnwBborI8z37j1EqREbUjn3spwD+liPt
            exlUTZLCfbjpfnNWkMzdoncRgmtnb02pP7COiecZY4RNv+euQO2ePz7a0v5j6o8f
            AK0AKvh6+Av66Ns1zS6FWPO/ggkXTrjLLgv8H7Ywzx/cnNXy7cuNR6DDhuLaRwyl
            UCzQTwtcy4yjgrVxSKlyfhJ8YwqBUpvT/KsFUGqDFPD+u6HCKGH7O9Y3kWuh/3hO
            nlylypKYq4MY6+dCl74KJ9mKihtabIcEK93Hb/mZurQdWypA1Ln3ATpQYFlE9D+d
            5yqziRmu1LGll7J+jEhh1pBXsgk1AgMBAAGjQjBAMA8GA1UdEwEB/wQFMAMBAf8w
            HQYDVR0OBBYEFCdouSHtGJZ1ZLWziCm+OQoNsy8IMA4GA1UdDwEB/wQEAwIBhjAN
            BgkqhkiG9w0BAQ0FAAOCAgEAWxxn27pI7T/OB12OFb9CsGmO3DYu5sGeuIfPndBh
            YuWw3vEq5HAtgAAhj645nvhJDPK5LG3BAGb57tChexEeni21V9g9AUR/Liwrb7je
            ef8/DfgVTaqqs2vG2tlwScvCdvl8M+sF1BUTM6kudxaj2/2QK/6zv5jWUFai9vjw
            XKz/lxN8EJHDIQMPAuIQbCmPDE92UpjkVA0B3uACbGIfRTWbFQbEKirs8A8lF8jb
            314kYNpMkWC5j16nhlpb7ttQAi3b0cWuHq1JxBq363HnFpcDXVQmavgpOIlojZuU
            30mMjJPXaj97vgcdX3TuB1ZAnJBbLgm8jDtk/TrDQeijIk1McMtA5c+2zXyCS7Dh
            7AD0YV0Qk9uy14mLdv3Zl1TG8Vmb7CIhwO5H+QNpYdrjtmzvhlTciDnQr5qAZQvP
            Poo/+mFd0lUto0UOdPBnvpEWnuRmjm6XbotLj1YSb6wJz+h4VcVakzMn/z1cJbkd
            GD/A/4lkxbuzh2vTx25EuLuc6dc1DluHpTA7v9nzE4eGmrLBG9CK1vpDM2oB3FIZ
            FGmyN8SCEsYh6ImhwNZNQc91jL8d7TImNIRW7XSs4sDDLrfLd6MgQF8fhY8/LgA0
            Z54UOSYSyD93MmYvnSnuo/kBStC7d69vhnx2K292P7AU4JryVF1xo3lo9SvaHOaQ
            8EE=
            -----END CERTIFICATE-----
        EOT -> null
      - certificate_authority_arn   = "arn:aws:acm-pca:ca-central-1:239043911459:certificate-authority/96eb8ee4-b746-4b80-803a-ae5ecdbca932" -> null
      - certificate_signing_request = <<-EOT
            -----BEGIN CERTIFICATE REQUEST-----
            MIIEiDCCAnACAQAwITEfMB0GA1UEAwwWbm90aWZpY2F0aW9uLmNhbmFkYS5jYTCC
            AiIwDQYJKoZIhvcNAQEBBQADggIPADCCAgoCggIBAOZc31f25t9qp59KKEBt3D30
            vBP7F9zqd0Bo3M1Scp5iXERxosLLiNvAHZsA7KxpYokROoV6ljhT4wjNdHaoKtYf
            5CipcYJDNGRqEeGZgBk4yYAC2i1o4IuPK/7kp1GMcv9K+4aJ4m4ilSSho1bdaPg9
            PZdsI4Hd5AcjZXSHjsQaS+ptdRSpFJZZks79vZEQ+2WB9WSxAne84OCZ8Ec7ADLD
            wZbpEsr3gmjKeub9VnGkur6s4gI/U1X3wFiJiLoTOA6268O3YrNTh3QNE55PJt1z
            UVPkXL66YmRLKg3coXVmwCrMTsqe+YezLLO/ukMHIcCIcSB/pIr57s6Hto27s1sP
            Wdbj6yMk2mzDEvekaMRfim/4MnwBborI8z37j1EqREbUjn3spwD+liPtexlUTZLC
            fbjpfnNWkMzdoncRgmtnb02pP7COiecZY4RNv+euQO2ePz7a0v5j6o8fAK0AKvh6
            +Av66Ns1zS6FWPO/ggkXTrjLLgv8H7Ywzx/cnNXy7cuNR6DDhuLaRwylUCzQTwtc
            y4yjgrVxSKlyfhJ8YwqBUpvT/KsFUGqDFPD+u6HCKGH7O9Y3kWuh/3hOnlylypKY
            q4MY6+dCl74KJ9mKihtabIcEK93Hb/mZurQdWypA1Ln3ATpQYFlE9D+d5yqziRmu
            1LGll7J+jEhh1pBXsgk1AgMBAAGgIjAgBgkqhkiG9w0BCQ4xEzARMA8GA1UdEwEB
            /wQFMAMBAf8wDQYJKoZIhvcNAQENBQADggIBAJ5JCg+1KJpMxUi5aQyIE/Gf0gVX
            G8muCM/hyRNVCi7dB9jWeKzc6A8vz1jCyXe8gy13f2rfjFZOrOqlpDs/xbgLSNtp
            zR76n3H3U7dBkSPMzOi62afxb/EEfn+B+3MA/f8/oZliXJ/1f0Gzzy+OUhyzXtcM
            VqCGZRqGEKMEjNlK0rcws+g20YiBVn0/HiSHoXehKpb7pkvdxZLoWNYegg0QI4Iv
            URRcVekul3a1F5nhlKpPQRdrOTzrloVrvh2DspN450fvSuWI9FC3IYW0FoLFEy6p
            I9t5MgtrhnAGpyBPoGw+T0SlPq7NVI/KmE1MXwCtaBD0AwG631LTQyewxCwPPcqq
            I+SW+fqNHi8RrDi56BLxDupxcCUFP3XeTQQVmBJbC+8kXxPBanFfyk/l15sdv/qJ
            zI34XvhkBqmuk1/KEvvlxHAGeBTpdOpaZEduQnxuCoXXf9d4XBHfp6ixmwv9Pncy
            UNSgS8vFELYbyWTlUO+Ldf/D5ABnEXazD2FrDWIqx4pZJ7PJyVnU+z77cTQMLCGX
            OfkatuhBv7kxuYv+3oYgLse2n77kGTPjShn2V63gE7xjQoBiewriryOLDyvn9dpp
            Kwt/y9jfBcia4+hqodLFUIEJGk67VJmXJcWI6qeYtHob8/QBEK/H9VIYXEAhs78/
            wVuC7JWcsBXpHSZA
            -----END CERTIFICATE REQUEST-----
        EOT -> null
      - id                          = "arn:aws:acm-pca:ca-central-1:239043911459:certificate-authority/96eb8ee4-b746-4b80-803a-ae5ecdbca932/certificate/7f814242df26f725857f48c48d5dd2dd" -> null
      - signing_algorithm           = "SHA512WITHRSA" -> null
      - template_arn                = "arn:aws:acm-pca:::template/RootCACertificate/V1" -> null
        # (1 unchanged attribute hidden)

      - validity {
          - type  = "YEARS" -> null
          - value = "5" -> null
        }
    }

  # aws_acmpca_certificate_authority.client_vpn will be destroyed
  # (because aws_acmpca_certificate_authority.client_vpn is not in configuration)
  - resource "aws_acmpca_certificate_authority" "client_vpn" {
      - arn                             = "arn:aws:acm-pca:ca-central-1:239043911459:certificate-authority/96eb8ee4-b746-4b80-803a-ae5ecdbca932" -> null
      - certificate                     = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIFDjCCAvagAwIBAgIQf4FCQt8m9yWFf0jEjV3S3TANBgkqhkiG9w0BAQ0FADAh
            MR8wHQYDVQQDDBZub3RpZmljYXRpb24uY2FuYWRhLmNhMB4XDTI0MDkxMDEzNTky
            MFoXDTI5MDkxMDE0NTkyMFowITEfMB0GA1UEAwwWbm90aWZpY2F0aW9uLmNhbmFk
            YS5jYTCCAiIwDQYJKoZIhvcNAQEBBQADggIPADCCAgoCggIBAOZc31f25t9qp59K
            KEBt3D30vBP7F9zqd0Bo3M1Scp5iXERxosLLiNvAHZsA7KxpYokROoV6ljhT4wjN
            dHaoKtYf5CipcYJDNGRqEeGZgBk4yYAC2i1o4IuPK/7kp1GMcv9K+4aJ4m4ilSSh
            o1bdaPg9PZdsI4Hd5AcjZXSHjsQaS+ptdRSpFJZZks79vZEQ+2WB9WSxAne84OCZ
            8Ec7ADLDwZbpEsr3gmjKeub9VnGkur6s4gI/U1X3wFiJiLoTOA6268O3YrNTh3QN
            E55PJt1zUVPkXL66YmRLKg3coXVmwCrMTsqe+YezLLO/ukMHIcCIcSB/pIr57s6H
            to27s1sPWdbj6yMk2mzDEvekaMRfim/4MnwBborI8z37j1EqREbUjn3spwD+liPt
            exlUTZLCfbjpfnNWkMzdoncRgmtnb02pP7COiecZY4RNv+euQO2ePz7a0v5j6o8f
            AK0AKvh6+Av66Ns1zS6FWPO/ggkXTrjLLgv8H7Ywzx/cnNXy7cuNR6DDhuLaRwyl
            UCzQTwtcy4yjgrVxSKlyfhJ8YwqBUpvT/KsFUGqDFPD+u6HCKGH7O9Y3kWuh/3hO
            nlylypKYq4MY6+dCl74KJ9mKihtabIcEK93Hb/mZurQdWypA1Ln3ATpQYFlE9D+d
            5yqziRmu1LGll7J+jEhh1pBXsgk1AgMBAAGjQjBAMA8GA1UdEwEB/wQFMAMBAf8w
            HQYDVR0OBBYEFCdouSHtGJZ1ZLWziCm+OQoNsy8IMA4GA1UdDwEB/wQEAwIBhjAN
            BgkqhkiG9w0BAQ0FAAOCAgEAWxxn27pI7T/OB12OFb9CsGmO3DYu5sGeuIfPndBh
            YuWw3vEq5HAtgAAhj645nvhJDPK5LG3BAGb57tChexEeni21V9g9AUR/Liwrb7je
            ef8/DfgVTaqqs2vG2tlwScvCdvl8M+sF1BUTM6kudxaj2/2QK/6zv5jWUFai9vjw
            XKz/lxN8EJHDIQMPAuIQbCmPDE92UpjkVA0B3uACbGIfRTWbFQbEKirs8A8lF8jb
            314kYNpMkWC5j16nhlpb7ttQAi3b0cWuHq1JxBq363HnFpcDXVQmavgpOIlojZuU
            30mMjJPXaj97vgcdX3TuB1ZAnJBbLgm8jDtk/TrDQeijIk1McMtA5c+2zXyCS7Dh
            7AD0YV0Qk9uy14mLdv3Zl1TG8Vmb7CIhwO5H+QNpYdrjtmzvhlTciDnQr5qAZQvP
            Poo/+mFd0lUto0UOdPBnvpEWnuRmjm6XbotLj1YSb6wJz+h4VcVakzMn/z1cJbkd
            GD/A/4lkxbuzh2vTx25EuLuc6dc1DluHpTA7v9nzE4eGmrLBG9CK1vpDM2oB3FIZ
            FGmyN8SCEsYh6ImhwNZNQc91jL8d7TImNIRW7XSs4sDDLrfLd6MgQF8fhY8/LgA0
            Z54UOSYSyD93MmYvnSnuo/kBStC7d69vhnx2K292P7AU4JryVF1xo3lo9SvaHOaQ
            8EE=
            -----END CERTIFICATE-----
        EOT -> null
      - certificate_signing_request     = <<-EOT
            -----BEGIN CERTIFICATE REQUEST-----
            MIIEiDCCAnACAQAwITEfMB0GA1UEAwwWbm90aWZpY2F0aW9uLmNhbmFkYS5jYTCC
            AiIwDQYJKoZIhvcNAQEBBQADggIPADCCAgoCggIBAOZc31f25t9qp59KKEBt3D30
            vBP7F9zqd0Bo3M1Scp5iXERxosLLiNvAHZsA7KxpYokROoV6ljhT4wjNdHaoKtYf
            5CipcYJDNGRqEeGZgBk4yYAC2i1o4IuPK/7kp1GMcv9K+4aJ4m4ilSSho1bdaPg9
            PZdsI4Hd5AcjZXSHjsQaS+ptdRSpFJZZks79vZEQ+2WB9WSxAne84OCZ8Ec7ADLD
            wZbpEsr3gmjKeub9VnGkur6s4gI/U1X3wFiJiLoTOA6268O3YrNTh3QNE55PJt1z
            UVPkXL66YmRLKg3coXVmwCrMTsqe+YezLLO/ukMHIcCIcSB/pIr57s6Hto27s1sP
            Wdbj6yMk2mzDEvekaMRfim/4MnwBborI8z37j1EqREbUjn3spwD+liPtexlUTZLC
            fbjpfnNWkMzdoncRgmtnb02pP7COiecZY4RNv+euQO2ePz7a0v5j6o8fAK0AKvh6
            +Av66Ns1zS6FWPO/ggkXTrjLLgv8H7Ywzx/cnNXy7cuNR6DDhuLaRwylUCzQTwtc
            y4yjgrVxSKlyfhJ8YwqBUpvT/KsFUGqDFPD+u6HCKGH7O9Y3kWuh/3hOnlylypKY
            q4MY6+dCl74KJ9mKihtabIcEK93Hb/mZurQdWypA1Ln3ATpQYFlE9D+d5yqziRmu
            1LGll7J+jEhh1pBXsgk1AgMBAAGgIjAgBgkqhkiG9w0BCQ4xEzARMA8GA1UdEwEB
            /wQFMAMBAf8wDQYJKoZIhvcNAQENBQADggIBAJ5JCg+1KJpMxUi5aQyIE/Gf0gVX
            G8muCM/hyRNVCi7dB9jWeKzc6A8vz1jCyXe8gy13f2rfjFZOrOqlpDs/xbgLSNtp
            zR76n3H3U7dBkSPMzOi62afxb/EEfn+B+3MA/f8/oZliXJ/1f0Gzzy+OUhyzXtcM
            VqCGZRqGEKMEjNlK0rcws+g20YiBVn0/HiSHoXehKpb7pkvdxZLoWNYegg0QI4Iv
            URRcVekul3a1F5nhlKpPQRdrOTzrloVrvh2DspN450fvSuWI9FC3IYW0FoLFEy6p
            I9t5MgtrhnAGpyBPoGw+T0SlPq7NVI/KmE1MXwCtaBD0AwG631LTQyewxCwPPcqq
            I+SW+fqNHi8RrDi56BLxDupxcCUFP3XeTQQVmBJbC+8kXxPBanFfyk/l15sdv/qJ
            zI34XvhkBqmuk1/KEvvlxHAGeBTpdOpaZEduQnxuCoXXf9d4XBHfp6ixmwv9Pncy
            UNSgS8vFELYbyWTlUO+Ldf/D5ABnEXazD2FrDWIqx4pZJ7PJyVnU+z77cTQMLCGX
            OfkatuhBv7kxuYv+3oYgLse2n77kGTPjShn2V63gE7xjQoBiewriryOLDyvn9dpp
            Kwt/y9jfBcia4+hqodLFUIEJGk67VJmXJcWI6qeYtHob8/QBEK/H9VIYXEAhs78/
            wVuC7JWcsBXpHSZA
            -----END CERTIFICATE REQUEST-----
        EOT -> null
      - enabled                         = true -> null
      - id                              = "arn:aws:acm-pca:ca-central-1:239043911459:certificate-authority/96eb8ee4-b746-4b80-803a-ae5ecdbca932" -> null
      - key_storage_security_standard   = "FIPS_140_2_LEVEL_3_OR_HIGHER" -> null
      - not_after                       = "2029-09-10T14:59:20Z" -> null
      - not_before                      = "2024-09-10T13:59:20Z" -> null
      - permanent_deletion_time_in_days = 7 -> null
      - serial                          = "169483105696590139062533785476554150621" -> null
      - tags                            = {} -> null
      - tags_all                        = {} -> null
      - type                            = "ROOT" -> null
      - usage_mode                      = "GENERAL_PURPOSE" -> null
        # (1 unchanged attribute hidden)

      - certificate_authority_configuration {
          - key_algorithm     = "RSA_4096" -> null
          - signing_algorithm = "SHA512WITHRSA" -> null

          - subject {
              - common_name                  = "notification.canada.ca" -> null
                # (12 unchanged attributes hidden)
            }
        }

      - revocation_configuration {
          - crl_configuration {
              - enabled            = false -> null
              - expiration_in_days = 0 -> null
                # (3 unchanged attributes hidden)
            }
          - ocsp_configuration {
              - enabled           = false -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_acmpca_certificate_authority_certificate.client_vpn will be destroyed
  # (because aws_acmpca_certificate_authority_certificate.client_vpn is not in configuration)
  - resource "aws_acmpca_certificate_authority_certificate" "client_vpn" {
      - certificate               = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIFDjCCAvagAwIBAgIQf4FCQt8m9yWFf0jEjV3S3TANBgkqhkiG9w0BAQ0FADAh
            MR8wHQYDVQQDDBZub3RpZmljYXRpb24uY2FuYWRhLmNhMB4XDTI0MDkxMDEzNTky
            MFoXDTI5MDkxMDE0NTkyMFowITEfMB0GA1UEAwwWbm90aWZpY2F0aW9uLmNhbmFk
            YS5jYTCCAiIwDQYJKoZIhvcNAQEBBQADggIPADCCAgoCggIBAOZc31f25t9qp59K
            KEBt3D30vBP7F9zqd0Bo3M1Scp5iXERxosLLiNvAHZsA7KxpYokROoV6ljhT4wjN
            dHaoKtYf5CipcYJDNGRqEeGZgBk4yYAC2i1o4IuPK/7kp1GMcv9K+4aJ4m4ilSSh
            o1bdaPg9PZdsI4Hd5AcjZXSHjsQaS+ptdRSpFJZZks79vZEQ+2WB9WSxAne84OCZ
            8Ec7ADLDwZbpEsr3gmjKeub9VnGkur6s4gI/U1X3wFiJiLoTOA6268O3YrNTh3QN
            E55PJt1zUVPkXL66YmRLKg3coXVmwCrMTsqe+YezLLO/ukMHIcCIcSB/pIr57s6H
            to27s1sPWdbj6yMk2mzDEvekaMRfim/4MnwBborI8z37j1EqREbUjn3spwD+liPt
            exlUTZLCfbjpfnNWkMzdoncRgmtnb02pP7COiecZY4RNv+euQO2ePz7a0v5j6o8f
            AK0AKvh6+Av66Ns1zS6FWPO/ggkXTrjLLgv8H7Ywzx/cnNXy7cuNR6DDhuLaRwyl
            UCzQTwtcy4yjgrVxSKlyfhJ8YwqBUpvT/KsFUGqDFPD+u6HCKGH7O9Y3kWuh/3hO
            nlylypKYq4MY6+dCl74KJ9mKihtabIcEK93Hb/mZurQdWypA1Ln3ATpQYFlE9D+d
            5yqziRmu1LGll7J+jEhh1pBXsgk1AgMBAAGjQjBAMA8GA1UdEwEB/wQFMAMBAf8w
            HQYDVR0OBBYEFCdouSHtGJZ1ZLWziCm+OQoNsy8IMA4GA1UdDwEB/wQEAwIBhjAN
            BgkqhkiG9w0BAQ0FAAOCAgEAWxxn27pI7T/OB12OFb9CsGmO3DYu5sGeuIfPndBh
            YuWw3vEq5HAtgAAhj645nvhJDPK5LG3BAGb57tChexEeni21V9g9AUR/Liwrb7je
            ef8/DfgVTaqqs2vG2tlwScvCdvl8M+sF1BUTM6kudxaj2/2QK/6zv5jWUFai9vjw
            XKz/lxN8EJHDIQMPAuIQbCmPDE92UpjkVA0B3uACbGIfRTWbFQbEKirs8A8lF8jb
            314kYNpMkWC5j16nhlpb7ttQAi3b0cWuHq1JxBq363HnFpcDXVQmavgpOIlojZuU
            30mMjJPXaj97vgcdX3TuB1ZAnJBbLgm8jDtk/TrDQeijIk1McMtA5c+2zXyCS7Dh
            7AD0YV0Qk9uy14mLdv3Zl1TG8Vmb7CIhwO5H+QNpYdrjtmzvhlTciDnQr5qAZQvP
            Poo/+mFd0lUto0UOdPBnvpEWnuRmjm6XbotLj1YSb6wJz+h4VcVakzMn/z1cJbkd
            GD/A/4lkxbuzh2vTx25EuLuc6dc1DluHpTA7v9nzE4eGmrLBG9CK1vpDM2oB3FIZ
            FGmyN8SCEsYh6ImhwNZNQc91jL8d7TImNIRW7XSs4sDDLrfLd6MgQF8fhY8/LgA0
            Z54UOSYSyD93MmYvnSnuo/kBStC7d69vhnx2K292P7AU4JryVF1xo3lo9SvaHOaQ
            8EE=
            -----END CERTIFICATE-----
        EOT -> null
      - certificate_authority_arn = "arn:aws:acm-pca:ca-central-1:239043911459:certificate-authority/96eb8ee4-b746-4b80-803a-ae5ecdbca932" -> null
      - id                        = "arn:aws:acm-pca:ca-central-1:239043911459:certificate-authority/96eb8ee4-b746-4b80-803a-ae5ecdbca932" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role.admin will be created
  + resource "aws_iam_role" "admin" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:aud" = "sts.amazonaws.com"
                              + "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub" = "system:serviceaccount:notification-canada-ca:notify-admin"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "admin-eks-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.document_download will be created
  + resource "aws_iam_role" "document_download" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:aud" = "sts.amazonaws.com"
                              + "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub" = "system:serviceaccount:notification-canada-ca:notify-document-download"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "document-download-eks-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.admin_worker will be created
  + resource "aws_iam_role_policy_attachment" "admin_worker" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::239043911459:policy/notification-worker-policy"
      + role       = "admin-eks-role"
    }

  # aws_iam_role_policy_attachment.document_download_worker will be created
  + resource "aws_iam_role_policy_attachment" "document_download_worker" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::239043911459:policy/notification-worker-policy"
      + role       = "document-download-eks-role"
    }

  # aws_iam_role_policy_attachment.parameters_csi_admin will be created
  + resource "aws_iam_role_policy_attachment" "parameters_csi_admin" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::239043911459:policy/parameters-csi-policy"
      + role       = "admin-eks-role"
    }

  # aws_iam_role_policy_attachment.parameters_csi_document_download will be created
  + resource "aws_iam_role_policy_attachment" "parameters_csi_document_download" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::239043911459:policy/parameters-csi-policy"
      + role       = "document-download-eks-role"
    }

  # aws_iam_role_policy_attachment.secrets_csi_admin will be created
  + resource "aws_iam_role_policy_attachment" "secrets_csi_admin" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::239043911459:policy/secrets-csi-policy"
      + role       = "admin-eks-role"
    }

  # aws_iam_role_policy_attachment.secrets_csi_document_download will be created
  + resource "aws_iam_role_policy_attachment" "secrets_csi_document_download" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::239043911459:policy/secrets-csi-policy"
      + role       = "document-download-eks-role"
    }

  # time_sleep.wait_for_cert_authority will be destroyed
  # (because time_sleep.wait_for_cert_authority is not in configuration)
  - resource "time_sleep" "wait_for_cert_authority" {
      - create_duration = "30s" -> null
      - id              = "2024-10-08T12:20:05Z" -> null
    }

  # tls_private_key.client_vpn will be created
  + resource "tls_private_key" "client_vpn" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # tls_self_signed_cert.client_vpn will be created
  + resource "tls_self_signed_cert" "client_vpn" {
      + allowed_uses          = [
          + "key_encipherment",
          + "digital_signature",
          + "server_auth",
          + "ipsec_end_system",
          + "ipsec_tunnel",
          + "any_extended",
          + "cert_signing",
        ]
      + cert_pem              = (known after apply)
      + early_renewal_hours   = 672
      + id                    = (known after apply)
      + is_ca_certificate     = false
      + key_algorithm         = (known after apply)
      + private_key_pem       = (sensitive value)
      + ready_for_renewal     = false
      + set_authority_key_id  = true
      + set_subject_key_id    = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 43800
      + validity_start_time   = (known after apply)

      + subject {
          + common_name = "vpn.staging.notification.canada.ca"
        }
    }

  # module.gha_vpn.aws_ec2_client_vpn_endpoint.this will be updated in-place
  ~ resource "aws_ec2_client_vpn_endpoint" "this" {
        id                      = "cvpn-endpoint-00372575183626903"
      ~ server_certificate_arn  = "arn:aws:acm:ca-central-1:239043911459:certificate/1da1e99f-489f-40a0-8fd9-6db469269906" -> (known after apply)
        tags                    = {
            "CostCentre" = "notification-canada-ca-staging"
            "Source"     = "cds-snc/terraform-modules/client_vpn"
            "Terraform"  = "true"
        }
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder will be updated in-place
  ~ resource "aws_lambda_function" "sentinel_forwarder" {
        id                             = "sentinel-cloud-watch-forwarder"
      ~ layers                         = [
          ~ (sensitive value),
        ]
        tags                           = {
            "CostCentre" = "notification-canada-ca-staging"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.vpn.aws_ec2_client_vpn_endpoint.this will be updated in-place
  ~ resource "aws_ec2_client_vpn_endpoint" "this" {
        id                      = "cvpn-endpoint-09a79e8845a82dbf3"
      ~ server_certificate_arn  = "arn:aws:acm:ca-central-1:239043911459:certificate/1da1e99f-489f-40a0-8fd9-6db469269906" -> (known after apply)
        tags                    = {
            "CostCentre" = "notification-canada-ca-staging"
            "Source"     = "cds-snc/terraform-modules/client_vpn"
            "Terraform"  = "true"
        }
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 11 to add, 3 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
